Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.CreateAdaptiveComponentInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FamilySymbol)
Creates a FamilyInstance of Adaptive Component Family.
Remarks:
This method creates an Adaptive FamilyInstance and its PointElement references.
The references can be accessed by methods like GetInstancePointElementRefIds().
The PointElement references can be moved, rehosted or manipulated just like any
other PointElements. The FamilyInstance would then 'adapt' to these references.
doc:
The Document
famSymb:
The FamilySymbol
Returns:
The Family Instance
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document doc does not contain the element famSymb
-or-
The Symbol famSymb is not an Adaptive Family Symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to create adaptive component instance.
Since:
2012